/******************************************************************************
6 -8 abstract 类和接口的比较 

    abstract 类和 接口比较如下：
    
- abstract 类和接口都可以有abstract 方法 
- 接口中只可以有常量 不可以有变量 而 abstract 类中 即可以有常量也可以有变量 
- abstract类中 也可以有非abstract 方法 ，接口不可以

在设计程序时 可根据具体分析 来确定是使用抽象类 还是  接口 
abstract 类 除了 提供重要的 需要子类重写的 abstract 方法 外 
也提供了子类可以继承的变量 和 非 abstract 方法  ... ↑ 

如果某个问题不需要继承 ，只是需要若干个类给出某些重要的abstract 方法的实现细节 ，就可以考虑使用接口 


abstract ： 摘要

*******************************************************************************/


