/******************************************************************************
    共享变量和共有方法
    用public 修饰的成员变量的方法被称为共有变量和共有方法
*******************************************************************************/
class Tom{
    public float weight;
    public float f (float a, float b){
        return a + b ;
    }
}
/******************************************************************************
    当你在任何一个类TOM创建了一个对象后，该对象能访问自己的public 变量和类中 public 方法
*******************************************************************************/

class Jerry{
    void g(){
            Tom cat = new Tom();
            cat.weight = 23f;   // 合法
            float sum = cat.f(3,4); //合法
}


