/******************************************************************************

JAVA程序：编写一个应用程序求100以内的全部素数。

程序思路：
    
    编程思路 : 素数是不能作为除数的 循环，要是只能除以自己 ，就把她当成除数

*******************************************************************************/

public class Main{
    public static void main (String[] args) {
        
        int i , n;
        for (i = 2; i < 100 ; i++ ){
             for ( n = 2; n < i ; n ++ )
                 if(i % n == 0)
                  break;
            
            if (i == n)
            
            System.out.println(i + " " );
                
             
             
        } 
        
    }
}
