/******************************************************************************

JAVA程序：编写一个程序，求1!+2!+…+10!的值。

程序思路：
    10! = 10X9X8X7 .....
    

*******************************************************************************/

public class Main
{
	public static void main(String[] args) 
	{
        
        int fact = 1;
        int s = 0;
        
        for (int i = 0 ; i <= 10  ;i++ )
        {
            fact += fact*i;
            s += fact;
            
        }
        
        System.out.println("1!+2!+…+10!  = " + s );
        
	}
}
